'''
第三周 010.
蘋果、奇異果、鳳梨，三種水果價格及折扣表如下，且老闆為了回饋社會，決定再加碼，購買總顆數(三種水果加起來)達30顆，總金額再打8.7折。
今一顧客欲購買，蘋果:ｘ顆、 奇異果:ｙ顆、鳳梨:ｚ顆（n1、n2、n3 為使用者輸入），
請計算本次購買需花費多少錢？

-------------------------------------------------------------------
------------| 定價 | 1~10顆 | 11~15顆 | 16~20顆 | 21顆~ |
-------------------------------------------------------------------
| 蘋果-----| 30---| 原價----| 9.5折-----| 9折-------| 8折----|
-------------------------------------------------------------------
| 奇異果--| 70---| 原價----| 9折-------| 8.5折-----| 7.5折-|
-------------------------------------------------------------------
| 鳳梨-----| 40---| 原價----| 8.5折-----| 8折-------| 8折---|
-------------------------------------------------------------------

Sample Input：
10
10
10

Sample Output：
1218
'''

def getDiscount(x, discounts):
    if (x > 20):
        discount = discounts[0]
    elif (x > 15):
        discount = discounts[1]
    elif (x > 10):
        discount = discounts[2]
    elif (x > 0):
        discount = discounts[3]
    return discount

x = int(input())
y = int(input())
z = int(input())

A_discounts = [0.8,0.9,0.95,1.0]
B_discounts = [0.75,0.85,0.9,1.0]
C_discounts = [0.8,0.8,0.85,1.0]

A_discount = getDiscount(x, A_discounts)
B_discount = getDiscount(y, B_discounts)
C_discount = getDiscount(z, C_discounts)

cost = x*30*A_discount + y*70*B_discount + z*40*C_discount
if (x + y + z) >= 30:
    cost *= 0.87

print(int(cost))
